In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import re

In [3]:
df = pd.read_csv(r"C:\Users\Sayan\Google Drive\Data Science\Titanic_Dataset\train.csv")
print (df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

## 1. Groupby

In [7]:
df_groupby_sex = df[['Sex','Fare']].groupby('Sex').describe()
df_groupby_sex

         Fare
        count       mean        std   min        25%   50%    75%       max
Sex
female  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.00  512.3292
male    577.0  25.523893  43.138263  0.00   7.895800  10.5  26.55  512.3292

### 1.1 Unstacks

In [8]:
df_groupby_sex.unstack()

             Sex
Fare  count  female    314.000000
             male      577.000000
      mean   female     44.479818
             male       25.523893
      std    female     57.997698
             male       43.138263
      min    female      6.750000
             male        0.000000
      25%    female     12.071875
             male        7.895800
      50%    female     23.000000
             male       10.500000
      75%    female     55.000000
             male       26.550000
      max    female    512.329200
             male      512.329200
dtype: float64

In [9]:
df_groupby_sex.unstack().unstack()

Sex             female        male
Fare count  314.000000  577.000000
     mean    44.479818   25.523893
     std     57.997698   43.138263
     min      6.750000    0.000000
     25%     12.071875    7.895800
     50%     23.000000   10.500000
     75%     55.000000   26.550000
     max    512.329200  512.329200

In [10]:
df_groupby_sex.unstack().unstack().unstack()

Sex  female                                                               \
      count       mean        std   min        25%   50%   75%       max
Fare  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.0  512.3292

Sex    male
      count       mean        std  min     25%   50%    75%       max
Fare  577.0  25.523893  43.138263  0.0  7.8958  10.5  26.55  512.3292

## 2. Unstack with multi-index

In [11]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df['Parch'].unique()

array([0, 1, 2, 5, 3, 4, 6], dtype=int64)

In [16]:
df['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [22]:
df_groupby_parch_sex = df[['Parch','Sex','Fare']].groupby(['Parch','Sex']).count()
df_groupby_parch_sex

              Fare
Parch Sex
0     female   194
      male     484
1     female    60
      male      58
2     female    49
      male      31
3     female     4
      male       1
4     female     2
      male       2
5     female     4
      male       1
6     female     1

In [23]:
df_groupby_parch_sex.unstack()

        Fare
Sex   female   male
Parch
0      194.0  484.0
1       60.0   58.0
2       49.0   31.0
3        4.0    1.0
4        2.0    2.0
5        4.0    1.0
6        1.0    NaN

In [24]:
df_groupby_parch_sex.unstack().unstack()

      Sex     Parch
Fare  female  0        194.0
              1         60.0
              2         49.0
              3          4.0
              4          2.0
              5          4.0
              6          1.0
      male    0        484.0
              1         58.0
              2         31.0
              3          1.0
              4          2.0
              5          1.0
              6          NaN
dtype: float64

In [25]:
df_groupby_parch_sex.unstack().unstack().unstack()

Parch            0     1     2    3    4    5    6
     Sex
Fare female  194.0  60.0  49.0  4.0  2.0  4.0  1.0
     male    484.0  58.0  31.0  1.0  2.0  1.0  NaN

In [26]:
df_groupby_parch_sex.unstack().unstack().unstack().unstack()

Parch      0             1            2            3           4           5  \
Sex   female   male female  male female  male female male female male female
Fare   194.0  484.0   60.0  58.0   49.0  31.0    4.0  1.0    2.0  2.0    4.0

Parch           6
Sex   male female male
Fare   1.0    1.0  NaN

In [27]:
df_groupby_parch_sex.unstack().unstack().unstack().unstack().unstack()

Parch  Sex
0      female  Fare    194.0
       male    Fare    484.0
1      female  Fare     60.0
       male    Fare     58.0
2      female  Fare     49.0
       male    Fare     31.0
3      female  Fare      4.0
       male    Fare      1.0
4      female  Fare      2.0
       male    Fare      2.0
5      female  Fare      4.0
       male    Fare      1.0
6      female  Fare      1.0
       male    Fare      NaN
dtype: float64

In [28]:
df_groupby_parch_sex.unstack().unstack().unstack().unstack().unstack().unstack()

               Fare
Parch Sex
0     female  194.0
      male    484.0
1     female   60.0
      male     58.0
2     female   49.0
      male     31.0
3     female    4.0
      male      1.0
4     female    2.0
      male      2.0
5     female    4.0
      male      1.0
6     female    1.0
      male      NaN

# 3. Multi-index indexing

In [39]:
df_groupby_parch_sex

              Fare
Parch Sex
0     female   194
      male     484
1     female    60
      male      58
2     female    49
      male      31
3     female     4
      male       1
4     female     2
      male       2
5     female     4
      male       1
6     female     1

In [45]:
df_groupby_parch_sex.loc[1,'male']

Fare    58
Name: (1, male), dtype: int64

In [46]:
df_groupby_parch_sex.iloc[1]

Fare    484
Name: (0, male), dtype: int64

# 3. Melt

In [29]:
help(pd.melt)

Help on function melt in module pandas.core.reshape.melt:

melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)
    Unpivots a DataFrame from wide format to long format, optionally
    leaving identifier variables set.

    This function is useful to massage a DataFrame into a format where one
    or more columns are identifier variables (`id_vars`), while all other
    columns, considered measured variables (`value_vars`), are "unpivoted" to
    the row axis, leaving just two non-identifier columns, 'variable' and
    'value'.


    Parameters
    ----------
    frame : DataFrame
    id_vars : tuple, list, or ndarray, optional
        Column(s) to use as identifier variables.
    value_vars : tuple, list, or ndarray, optional
        Column(s) to unpivot. If not specified, uses all columns that
        are not set as `id_vars`.
    var_name : scalar
        Name to use for the 'variable' column. If None it uses
        ``frame.columns.name`` or 'variable'.
    value_name : scalar, default 'value'
        Name to use for the 'value' column.
    col_level : int or string, optional
        If columns are a MultiIndex then use this level to melt.

    See Also
    --------
    DataFrame.melt
    pivot_table
    DataFrame.pivot

    Examples
    --------
    >>> df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
    ...                    'B': {0: 1, 1: 3, 2: 5},
    ...                    'C': {0: 2, 1: 4, 2: 6}})
    >>> df
       A  B  C
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> pd.melt(df, id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5
    3  a        C      2
    4  b        C      4
    5  c        C      6

    The names of 'variable' and 'value' columns can be customized:

    >>> pd.melt(df, id_vars=['A'], value_vars=['B'],
    ...         var_name='myVarname', value_name='myValname')
       A myVarname  myValname
    0  a         B          1
    1  b         B          3
    2  c         B          5

    If you have multi-index columns:

    >>> df.columns = [list('ABC'), list('DEF')]
    >>> df
       A  B  C
       D  E  F
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> pd.melt(df, col_level=0, id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> pd.melt(df, id_vars=[('A', 'D')], value_vars=[('B', 'E')])
      (A, D) variable_0 variable_1  value
    0      a          B          E      1
    1      b          B          E      3
    2      c          B          E      5

In [51]:
#melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)
df_melt = pd.melt(df,id_vars='Name',value_vars='Fare')
df_melt.head(10)

                                                Name variable    value
0                            Braund, Mr. Owen Harris     Fare   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Fare  71.2833
2                             Heikkinen, Miss. Laina     Fare   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Fare  53.1000
4                           Allen, Mr. William Henry     Fare   8.0500
5                                   Moran, Mr. James     Fare   8.4583
6                            McCarthy, Mr. Timothy J     Fare  51.8625
7                     Palsson, Master. Gosta Leonard     Fare  21.0750
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)     Fare  11.1333
9                Nasser, Mrs. Nicholas (Adele Achem)     Fare  30.0708

In [53]:
pd.melt(df,id_vars='Name',value_vars=['Sex','Parch']).head(10)

                                                Name variable   value
0                            Braund, Mr. Owen Harris      Sex    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      Sex  female
2                             Heikkinen, Miss. Laina      Sex  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      Sex  female
4                           Allen, Mr. William Henry      Sex    male
5                                   Moran, Mr. James      Sex    male
6                            McCarthy, Mr. Timothy J      Sex    male
7                     Palsson, Master. Gosta Leonard      Sex    male
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      Sex  female
9                Nasser, Mrs. Nicholas (Adele Achem)      Sex  female

# 5. Pivot Table

In [50]:
help(pd.pivot)

Help on function pivot in module pandas.core.reshape.pivot:

pivot(data, index=None, columns=None, values=None)
    Return reshaped DataFrame organized by given index / column values.

    Reshape data (produce a "pivot" table) based on column values. Uses
    unique values from specified `index` / `columns` to form axes of the
    resulting DataFrame. This function does not support data
    aggregation, multiple values will result in a MultiIndex in the
    columns. See the :ref:`User Guide <reshaping>` for more on reshaping.

    Parameters
    ----------
    data : DataFrame
    index : string or object, optional
        Column to use to make new frame's index. If None, uses
        existing index.
    columns : string or object
        Column to use to make new frame's columns.
    values : string, object or a list of the previous, optional
        Column(s) to use for populating new frame's values. If not
        specified, all remaining columns will be used and the result will
        have hierarchically indexed columns.

        .. versionchanged :: 0.23.0
           Also accept list of column names.

    Returns
    -------
    DataFrame
        Returns reshaped DataFrame.

    Raises
    ------
    ValueError:
        When there are any `index`, `columns` combinations with multiple
        values. `DataFrame.pivot_table` when you need to aggregate.

    See Also
    --------
    DataFrame.pivot_table : Generalization of pivot that can handle
        duplicate values for one index/column pair.
    DataFrame.unstack : Pivot based on the index values instead of a
        column.

    Notes
    -----
    For finer-tuned control, see hierarchical indexing documentation along
    with the related stack/unstack methods.

    Examples
    --------
    >>> df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
    ...                            'two'],
    ...                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    ...                    'baz': [1, 2, 3, 4, 5, 6],
    ...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
    >>> df
        foo   bar  baz  zoo
    0   one   A    1    x
    1   one   B    2    y
    2   one   C    3    z
    3   two   A    4    q
    4   two   B    5    w
    5   two   C    6    t

    >>> df.pivot(index='foo', columns='bar', values='baz')
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar')['baz']
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])
          baz       zoo
    bar   A  B  C   A  B  C
    foo
    one   1  2  3   x  y  z
    two   4  5  6   q  w  t

    A ValueError is raised if there are any duplicates.

    >>> df = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
    ...                    "bar": ['A', 'A', 'B', 'C'],
    ...                    "baz": [1, 2, 3, 4]})
    >>> df
       foo bar  baz
    0  one   A    1
    1  one   A    2
    2  two   B    3
    3  two   C    4

    Notice that the first two rows are the same for our `index`
    and `columns` arguments.

    >>> df.pivot(index='foo', columns='bar', values='baz')
    Traceback (most recent call last):
       ...
    ValueError: Index contains duplicate entries, cannot reshape

In [55]:
df_melt.head()

                                                Name variable    value
0                            Braund, Mr. Owen Harris     Fare   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Fare  71.2833
2                             Heikkinen, Miss. Laina     Fare   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Fare  53.1000
4                           Allen, Mr. William Henry     Fare   8.0500

In [57]:
#pivot(data, index=None, columns=None, values=None)
df_melt.pivot(index='Name', columns='variable', values='value')

variable                                             Fare
Name
Abbing, Mr. Anthony                                7.5500
Abbott, Mr. Rossmore Edward                       20.2500
Abbott, Mrs. Stanton (Rosa Hunt)                  20.2500
Abelson, Mr. Samuel                               24.0000
Abelson, Mrs. Samuel (Hannah Wizosky)             24.0000
Adahl, Mr. Mauritz Nils Martin                     7.2500
Adams, Mr. John                                    8.0500
Ahlin, Mrs. Johan (Johanna Persdotter Larsson)     9.4750
Aks, Mrs. Sam (Leah Rosen)                         9.3500
Albimona, Mr. Nassef Cassem                       18.7875
Alexander, Mr. William                             7.8875
Alhomaki, Mr. Ilmari Rudolf                        7.9250
Ali, Mr. Ahmed                                     7.0500
Ali, Mr. William                                   7.0500
Allen, Miss. Elisabeth Walton                    211.3375
Allen, Mr. William Henry                           8.0500
Allison, Master. Hudson Trevor                   151.5500
Allison, Miss. Helen Loraine                     151.5500
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  151.5500
Allum, Mr. Owen George                             8.3000
Andersen-Jensen, Miss. Carla Christine Nielsine    7.8542
Anderson, Mr. Harry                               26.5500
Andersson, Master. Sigvard Harald Elias           31.2750
Andersson, Miss. Ebba Iris Alfrida                31.2750
Andersson, Miss. Ellis Anna Maria                 31.2750
Andersson, Miss. Erna Alexandra                    7.9250
Andersson, Miss. Ingeborg Constanzia              31.2750
Andersson, Miss. Sigrid Elisabeth                 31.2750
Andersson, Mr. Anders Johan                       31.2750
Andersson, Mr. August Edvard ("Wennerstrom")       7.7958
...                                                   ...
Widegren, Mr. Carl/Charles Peter                   7.7500
Widener, Mr. Harry Elkins                        211.5000
Wiklund, Mr. Jakob Alfred                          6.4958
Wilhelms, Mr. Charles                             13.0000
Willey, Mr. Edward                                 7.5500
Williams, Mr. Charles Duane                       61.3792
Williams, Mr. Charles Eugene                      13.0000
Williams, Mr. Howard Hugh "Harry"                  8.0500
Williams, Mr. Leslie                              16.1000
Williams-Lambert, Mr. Fletcher Fellows            35.0000
Windelov, Mr. Einar                                7.2500
Wiseman, Mr. Phillippe                             7.2500
Woolner, Mr. Hugh                                 35.5000
Wright, Mr. George                                26.5500
Yasbeck, Mr. Antoni                               14.4542
Yasbeck, Mrs. Antoni (Selini Alexander)           14.4542
Young, Miss. Marie Grice                         135.6333
Youseff, Mr. Gerious                               7.2250
Yousif, Mr. Wazli                                  7.2250
Yousseff, Mr. Gerious                             14.4583
Yrois, Miss. Henriette ("Mrs Harbeck")            13.0000
Zabour, Miss. Hileni                              14.4542
Zabour, Miss. Thamine                             14.4542
Zimmerman, Mr. Leo                                 7.8750
de Messemaeker, Mrs. Guillaume Joseph (Emma)      17.4000
de Mulder, Mr. Theodore                            9.5000
de Pelsmaeker, Mr. Alfons                          9.5000
del Carlo, Mr. Sebastiano                         27.7208
van Billiard, Mr. Austin Blyler                   14.5000
van Melkebeke, Mr. Philemon                        9.5000

[891 rows x 1 columns]